Revit 2027 API
Wall.SketchId Property
 Returns id of the profile sketch, or invalidElementId if sketch does not exist.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId SketchId { get; }
Public ReadOnly Property SketchId As ElementId
	Get
public:
property ElementId^ SketchId {
	ElementId^ get ();
}
member SketchId : ElementId with get
Property Value
ElementId
Remarks
 To create profile Sketch for the Wall, call CreateProfileSketch().
See Also
Reference
Wall Class
Autodesk.Revit.DB Namespace